function player(num){
    var words = {
    "name":"你从未离去",
    "singer":"白挺",
    "img":"app.webp",
    "audio":"app.m4a",
    "lyric": [
        ["00","你从未离去 - 白挺（Mr.White）"],
        ["05","词：崔铁志/万秦"],
        ["08","曲：李智平"],
        ["15.5","浩瀚星空里"],
        ["17.8","只剩你的背影"],
        ["21.6","银河已凝成冰"],
        ["24.5","记忆划过泪滴"],
        ["28","想象能回到过去"],
        ["31","终会存在我心底"],
        ["33","虽然逃避"],
        ["36","她消失在梦里"],
        ["41.9","日出的幻景"],
        ["44.5","再次感觉到你"],
        ["48.5","风送来你的呼吸"],
        ["51.5","月色倒映着惊喜"],
        ["54","原来你从未离去"],
        ["58","默默守护在这里"],
        ["60","无声无息"],
        ["62","如影随形"],
        ["66.5","我不再迷茫"],
        ["70","思念是唯一的行囊"],
        ["73","漫天的星光"],
        ["76.5","有一颗是你的愿望"],
        ["80","前方的路不再孤单漫长"],
        ["83.5","天空下你我不再守望"],
        ["87","轻声歌唱"],
        ["90","在我身旁"],
        ["107.5","日出的幻景"],
        ["111.5","再次感觉到你"],
        ["114","风送来你的呼吸"],
        ["118","月色倒映着惊喜"],
        ["121","原来你从未离去"],
        ["125","默默守护在这里"],
        ["127","无声无息"],
        ["130","如影随形"],
        ["133.4","我不再迷茫"],
        ["136","思念是唯一的行囊"],
        ["140","漫天的星光"],
        ["143","有一颗是你的愿望"],
        ["147","前方的路不再孤单漫长"],
        ["150","天空下你我不再守望"],
        ["154","轻声歌唱"],
        ["157","在我身旁"],
        ["160","我不再迷茫"],
        ["163","思念是唯一的行囊"],
        ["167","漫天的星光"],
        ["170","有一颗是你的愿望"],
        ["173.5","前方的路不再孤单漫长"],
        ["177","天空下你我不再守望"],
        ["180","轻声歌唱"],
        ["183.8","在我身旁"]
    ]
};
$(".copy_name").innerHTML = words.name;
$(".copy_singer").innerHTML = words.singer;
t = words.audio;
imgurl = words.img;
Time = [];
let ar = words.lyric;
let oppo = [];
ar.forEach(
    function(value,index,array){
        Time[Time.length] = value[0];
        oppo[oppo.length] = value[1];
    }
);
var u = document.querySelector(".passage");
oppo.forEach(
    function(value,index){
        u.innerHTML += "<p>" + value + "</p>";
    }
);
}
player(1);